/*
 
  English.strings
  Pock

  Created by Pierluigi Galdi on 12/03/21.
  
*/

// MARK: Base
"base.website_url" = "https://pock.app";
"base.widget" = "widget";

// MARK: General
"general.welcome-to-pock" = "Welcome to Pock";
"general.pock-widgets-manager" = "Widgets manager for MacBook's Touch Bar";

// MARK: MainBarMenu
// General
"menu.general" = "General";
"menu.about" = "About Pock";
"menu.preferences" = "Preferences…";
// Widgets
"menu.widgets" = "Widgets";
"menu.widgets.manage-widgets" = "Manage widgets…";
"menu.widgets.install-widget" = "Install widget…";
// Customisation
"menu.customization" = "Customisation";
"menu.customization.pock" = "Customize Pock…";
"menu.customization.control-strip" = "Customize Control Strip…";
// Advanced
"menu.advanced" = "Advanced";
"menu.advanced.re-install-default-widgets" = "Re-install default widgets…";
"menu.advanced.open-widgets-folder" = "Open widgets folder…";
"menu.advanced.reload_pock" = "Reload Pock…";
"menu.advanced.relaunch_pock" = "Relaunch Pock…";
"menu.advanced.reload_touchbar" = "Reload Control Strip…";
"menu.advanced.relaunch_touchbar" = "Relaunch Touch Bar…";
"menu.developers" = "Developers";
"menu.advanced.show_debug_console" = "Show debug console…";
// Quit
"menu.goodbye" = "Goodbye";
"menu.quit" = "Quit Pock";

// MARK: Onboard Screen
"onboard.title" = "Get the Most Out of Your MacBook Pro Touch Bar";
"onboard.body" = "Pock comes with default widgets that let you access the most essential information and functionality of your frequently used controls and services.";
"onboard.footer" = "Follow the instructions in the Touch Bar to install default widgets";
"onboard.open-preferences" = "Open Preferences…";
"onboard.continue-with-default-settings" = "Continue with default settings";

// MARK: Preferences
"preferences.window.title" = "Preferences";

"preferences.general.title" = "General";
"preferences.general.allow-blank-touchbar.title" = "Allow blank Touch Bar";
"preferences.general.allow-blank-touchbar.desc" = "If enabled, you can turn the Touch Bar completely off just by removing any added widgets.";
"preferences.general.launch-at-login" = "Launch at login";

"preferences.layout.title" = "Layout";

"preferences.double-control.title" = "Switch to default Touch Bar";
"preferences.double-control.desc" = "Double press `^Control` key to toggle between Pock and System Touch Bar.";
"preferences.default-touchbar.shows" = "Default Touch Bar shows:";
"preferences.default-touchbar.desc" = "To work properly, Pock may override the default Touch Bar preferences.
You can always configure default settings from `System Preferences > Keyboard` to adapt the Touch Bar to your needs.";

"preferences.cursor-options.title" = "Cursor options";
"preferences.cursor-options.enable-mouse-support" = "Enable cursor support";
"preferences.cursor-options.show-tracking-area" = "Show tracking area";

"preferences.updates.check-for-updates-once-a-day" = "Check for updates once a day";

"preferences.updates.already-on-latest-version.title" = "Installed version: %@";
"preferences.updates.already-on-latest-version.message" = "Pock is already running on latest version.";
"preferences.updates.new-version-available.title" = "A new version is available";
"preferences.updates.new-version-available.message" = "Would you like to update Pock from version %@ to version %@?";

// MARK: Layout Style
"layout-style.show-control-strip" = "Show Control Strip";
"layout-style.full-width" = "Full width";

// MARK: Presentation Mode
"presentation-mode.app" = "App";
"presentation-mode.app-with-control-strip" = "App with Control Strip";
"presentation-mode.full-control-strip" = "Full Control Strip";
"presentation-mode.function-keys" = "Function Keys (Fn)";
"presentation-mode.workflows" = "Workflows";
"presentation-mode.workflows-with-control-strip" = "Workflow with Control Strip";
"presentation-mode.spaces" = "Spaces";
"presentation-mode.spaces-with-control-strip" = "Spaces with Control Strip";

// MARK: Widgets Manager
"widgets-manager.list.title" = "Widgets Manager";
"widgets-manager.list.select-widget" = "Select a widget from the list";
"widgets-manager.list.will-be-updated" = "\"%@\" widget will be updated";
"widgets-manager.list.did-update" = "\"%@\" widget updated.\nReload Pock to refresh.";
"widgets-manager.loading-preferences" = "Loading Preferences…";
"widgets-manager.list.no-preferences" = "This widget has no preferences";
"widgets-manager.list.reset-preferences" = "Reset preferences to default values";

// MARK: Empty Touch Bar
"widgets.defaults.tap-to-install" = "Tap to install default widgets…";
"widgets.empty.add-widgets-to-pock" = "Tap to add widgets to Pock…";

// MARK: Widget Install/Update

"widget.install.default.title" = "Install default widgets";
"widget.install.default.body" = "Would you like to install default widgets?";

"widget.installing.default.body" = "Processed: %d/%d";
"widget.installed.default.success.body" = "Default widgets was installed successfully!\nClick on `Relaunch` to relaunch Pock and enjoy your shiny-new Touch Bar!";

"widget.install.drag-here.title" = "Install new widget";
"widget.install.drag-here.body" = "Drag & Drop widget file inside this dialog, or click the `Choose…` button to pick up the file.";
"widget.install.drag-here.valid-formats" = "Accepted formats: .pock, .pkarchive";

"widget.remove.title" = "Remove %@ widget";
"widget.remove.body" = "Would you like to proceed and remove %@ widget?";
"widget.remove.click-to-continue" = "Click \"Remove\" to continue…";

"widget.install.title" = "Install %@ widget";
"widget.install.body" = "Would you like to proceed and install %@ widget?";
"widget.install.click-to-continue" = "Click \"Install\" to continue…";

"widget.update.title" = "New version available for %@ widget!";
"widget.update.body" = "Would you like to upgrade from version %@ to the new version %@?";
"widget.update.changelog.title" = "Changelog:";

"widget.removing.title" = "Removing %@ widget…";
"widget.removing.body" = "This process can take some time…";

"widget.installing.title" = "Installing %@ widget…";
"widget.installing.body" = "This process can take some time…";

"widget.downloading.title" = "Downloading %@ widget…";
"widget.downloading.body" = "This process can take some time…\n\nCalculating estimated progress:";

"widget.remove.error.title" = "Widget removing has failed!";
"widget.install.error.title" = "Widget installation has failed!";

"widget.error.title" = "Something went wrong…";
"widget.error.body" = "An error occured during the process.\n\n%@";

"widget.remove.success.title" = "Widget successfully removed!";
"widget.remove.success.body" = "Great, %@ widget was completely removed.\nClick on `Relaunch` to relaunch Pock.";

"widget.install.success.title" = "What a success!";
"widget.install.success.body" = "Congratulations, %@ widget is now ready to be added to the Touch Bar.\nReload Pock and then click on `Customize Pock…` option to personalize your widgets experience.";

"widget.update.success.title" = "Done!";
"widget.update.success.body" = "Congratulations, %@ widget is now updated to the latest version.\nClick on `Relaunch` to relaunch Pock.";

// MARK: Actions
"general.action.cancel" = "Cancel";
"general.action.start" = "Start";
"general.action.choose" = "Choose…";
"general.action.remove" = "Remove";
"general.action.removing" = "Removing…";
"general.action.install" = "Install";
"general.action.installing" = "Installing…";
"general.action.later" = "Maybe later";
"general.action.update" = "Update";
"general.action.downloading" = "Downloading…";
"general.action.check-for-updates" = "Check for updates";
"general.action.checking" = "Checking…";
"general.action.close" = "Close";
"general.action.reload" = "Reload";
"general.action.relaunch" = "Relaunch";
"general.action.customize" = "Customize";

// MARK: Errors
"error.unknown" = "Unknown error occured.";
"error.cant-copy" = "File can't be copied to destination folder.\n%@";
"error.cant-remove" = "Widget file can't be removed.\n%@";
"error.unknown-server-error" = "Unknown";

"error.updater.invalid-endpoint-url" = "Invalid URL.";
"error.updater.response-error" = "Invalid response from the server: %@";
"error.updater.parsing-error" = "Invalid response data.";
"error.updater.invalid-core-version" = "A new version for this widget is available, but your version of Pock is not supported. Please, update to the minimum supported version (%@) to install this widget's version.";

"error.downloader.invalid-file-url" = "Can't find requested file on remote server.";
"error.downloader.response-error" = "Can't request file. Server response: %@";
"error.downloader.download-error" = "Can't download requested file: %@";
"error.file-system-error" = "Can't manage file: %@\n\nPlease, check app permission and try again.";

// MARK: Debug console
"debug.console.floating-window" = "Floating window";
"debug.console.show-on-launch" = "Show on launch";
"debug.console.scroll-automatically" = "Scroll automatically";
"debug.console.clear-console" = "Clear console";
